In [1]:
import pandas as pd

# Load the datasets
postings = pd.read_csv('cleaned_data\Postings_Cleaned.csv')
companies = pd.read_csv('cleaned_data\Companies_Cleaned.csv')
company_industries = pd.read_csv('cleaned_data\Company_industries_cleaned.csv')
company_specialities = pd.read_csv('cleaned_data\Company_specialities_cleaned.csv')
employee_counts = pd.read_csv('cleaned_data\Employee_counts_cleaned.csv')
salaries = pd.read_csv('cleaned_data\Salaries_cleaned.csv')
job_skills = pd.read_csv('cleaned_data\Job_skills_cleaned.csv')
job_industries = pd.read_csv('cleaned_data\Job_industries_cleaned.csv')
benefits = pd.read_csv('cleaned_data\Benefits_cleaned.csv')

In [2]:
pd.set_option('display.max_columns', None)

In [24]:
postings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35564 entries, 0 to 35563
Data columns (total 30 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   job_id                      35564 non-null  int64
 1   company_name                35564 non-null  object
 2   title                       35564 non-null  object
 3   description                 35564 non-null  object
 4   max_salary                  35564 non-null  float64
 5   pay_period                  35564 non-null  object
 6   location                    35564 non-null  object
 7   company_id                  35564 non-null  float64
 8   views                       35564 non-null  float64
 9   med_salary                  35564 non-null  float64
 10  min_salary                  35564 non-null  float64
 11  formatted_work_type         35564 non-null  object
 12  applies                     35564 non-null  float64
 13  original_listed_time        35564 non-null  float64
 14  remote_allowed              35564 non-null  float64
 15  job_posting_url             35564 non-null  object
 16  application_url             35564 non-null  object
 17  application_type            35564 non-null  object
 18  expiry                      35564 non-null  float64
 19  formatted_experience_level  35564 non-null  object
 20  skills_desc                 35564 non-null  object
 21  listed_time                 35564 non-null  float64
 22  posting_domain              35564 non-null  object
 23  sponsored                   35564 non-null  int64
 24  work_type                   35564 non-null  object
 25  currency                    35564 non-null  object
 26  compensation_type           35564 non-null  object
 27  normalized_salary           35564 non-null  float64
 28  zip_code                    35564 non-null  object
 29  fips                        35564 non-null  float64
dtypes: float64(12), int64(2), object(16)
memory usage: 8.1+ MB

In [25]:
postings.head(6)

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,min_salary,formatted_work_type,applies,original_listed_time,remote_allowed,job_posting_url,application_url,application_type,expiry,formatted_experience_level,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type,normalized_salary,zip_code,fips
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,0.0,17.0,Full-time,2.0,1.713398e+12,0.0,https://www.linkedin.com/jobs/view/921716/?trk...,No URL provided,ComplexOnsiteApply,1.715990e+12,Not specified,Requirements: \n\nWe are seeking a College or ...,1.713398e+12,Unknown,0,FULL_TIME,USD,BASE_SALARY,38480.0,8540.0,34021.0
1,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,0.0,45000.0,Full-time,0.0,1.713278e+12,0.0,https://www.linkedin.com/jobs/view/10998357/?t...,No URL provided,ComplexOnsiteApply,1.715870e+12,Not specified,We are currently accepting resumes for FOH - A...,1.713278e+12,Unknown,0,FULL_TIME,USD,BASE_SALARY,55000.0,45202.0,39061.0
2,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,0.0,140000.0,Full-time,0.0,1.712896e+12,0.0,https://www.linkedin.com/jobs/view/23221523/?t...,No URL provided,ComplexOnsiteApply,1.715488e+12,Not specified,This position requires a baseline understandin...,1.712896e+12,Unknown,0,FULL_TIME,USD,BASE_SALARY,157500.0,11040.0,36059.0
3,91700727,Downtown Raleigh Alliance,Economic Development and Planning Intern,Job summary:The Economic Development & Plannin...,20.0,HOURLY,"Raleigh, NC",1481176.0,9.0,0.0,14.0,Internship,4.0,1.713456e+12,0.0,https://www.linkedin.com/jobs/view/91700727/?t...,No URL provided,ComplexOnsiteApply,1.716048e+12,Not specified,No description provided,1.713456e+12,Unknown,0,INTERNSHIP,USD,BASE_SALARY,35360.0,27601.0,37183.0
4,103254301,Raw Cereal,Producer,Company DescriptionRaw Cereal is a creative de...,300000.0,YEARLY,United States,81942316.0,7.0,0.0,60000.0,Contract,1.0,1.712861e+12,1.0,https://www.linkedin.com/jobs/view/103254301/?...,No URL provided,SimpleOnsiteApply,1.715453e+12,Not specified,No description provided,1.712861e+12,Unknown,0,CONTRACT,USD,BASE_SALARY,180000.0,Unknown,0.0
5,2264355,Bay West Church,Worship Leader,It is an exciting time to be a part of our chu...,0.0,MONTHLY,"Palm Bay, FL",28631247.0,5.0,350.0,0.0,Part-time,0.0,1.712456e+12,0.0,https://www.linkedin.com/jobs/view/2264355/?tr...,No URL provided,ComplexOnsiteApply,1.715048e+12,Not specified,"Knowledge, Skills and Abilities: 1. Proficient...",1.712456e+12,Unknown,0,PART_TIME,USD,BASE_SALARY,4200.0,32905.0,12009.0

In [3]:
postings = postings.drop(columns=[
    'application_url',           # To be deleted
    'application_type',          # To be deleted
    'formatted_experience_level',# To be deleted
    'posting_domain',            # To be deleted
    'sponsored'                  # To be deleted
])

In [4]:
postings = postings.astype({
    'job_id': 'int32',
    'company_name': 'string',    # Use 'string' for modern text processing (like VARCHAR)
    'title': 'string',
    'description': 'string',
    'max_salary': 'float',
    'pay_period': 'string',
    'location': 'string',
    'company_id': 'int32',
    'views': 'int32',
    'med_salary': 'float',
    'min_salary': 'float',
    'formatted_work_type': 'string',
    'applies': 'int32',
    'job_posting_url': 'string',
    'skills_desc': 'string',
    'work_type': 'string',
    'currency': 'string',
    'compensation_type': 'string',
    'normalized_salary': 'float',
    'zip_code': 'string',
    'fips': 'int32'
})

In [5]:
postings['original_listed_time'] = pd.to_datetime(postings['original_listed_time'], unit='ms', errors='coerce')
postings['expiry'] = pd.to_datetime(postings['expiry'], unit='ms', errors='coerce')
postings['listed_time'] = pd.to_datetime(postings['listed_time'], unit='ms', errors='coerce')

In [6]:
postings['remote_allowed'] = postings['remote_allowed'].apply(lambda x: True if x == 1 else False)

In [7]:
postings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35564 entries, 0 to 35563
Data columns (total 25 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   job_id                35564 non-null  int32
 1   company_name          35564 non-null  string
 2   title                 35564 non-null  string
 3   description           35564 non-null  string
 4   max_salary            35564 non-null  float64
 5   pay_period            35564 non-null  string
 6   location              35564 non-null  string
 7   company_id            35564 non-null  int32
 8   views                 35564 non-null  int32
 9   med_salary            35564 non-null  float64
 10  min_salary            35564 non-null  float64
 11  formatted_work_type   35564 non-null  string
 12  applies               35564 non-null  int32
 13  original_listed_time  35564 non-null  datetime64[ns]
 14  remote_allowed        35564 non-null  bool
 15  job_posting_url       35564 non-null  string
 16  expiry                35564 non-null  datetime64[ns]
 17  skills_desc           35564 non-null  string
 18  listed_time           35564 non-null  datetime64[ns]
 19  work_type             35564 non-null  string
 20  currency              35564 non-null  string
 21  compensation_type     35564 non-null  string
 22  normalized_salary     35564 non-null  float64
 23  zip_code              35564 non-null  string
 24  fips                  35564 non-null  int32
dtypes: bool(1), datetime64[ns](3), float64(4), int32(5), string(12)
memory usage: 5.9 MB

In [19]:
import os 

folder_path = 'updated_data'  # Change the name as needed

# Create the folder if it doesn't exist
os.makedirs(folder_path, exist_ok=True)

In [31]:
postings.to_csv(os.path.join(folder_path, 'Postings_Updated.csv'), index=False)

In [32]:
companies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24473 entries, 0 to 24472
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_id    24473 non-null  int64
 1   name          24473 non-null  object
 2   description   24473 non-null  object
 3   company_size  24473 non-null  float64
 4   state         24473 non-null  object
 5   country       24473 non-null  object
 6   city          24473 non-null  object
 7   zip_code      24473 non-null  object
 8   address       24473 non-null  object
 9   url           24473 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 1.9+ MB

In [33]:
companies.head(3)

,company_id,name,description,company_size,state,country,city,zip_code,address,url
0,1009,ibm,"At IBM, we do more than work. We create. We cr...",7.0,ny,us,"armonk, new york",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm
1,1016,ge healthcare,Every day millions of people feel the impact o...,7.0,0,us,chicago,0,-,https://www.linkedin.com/company/gehealthcare
2,1025,hewlett packard enterprise,Official LinkedIn of Hewlett Packard Enterpris...,7.0,texas,us,houston,77389,1701 E Mossy Oaks Rd Spring,https://www.linkedin.com/company/hewlett-packa...

In [34]:
companies['company_id'] = companies['company_id'].astype('int32')

companies['company_size'] = pd.to_numeric(companies['company_size'], errors='coerce').fillna(0).astype('int32')

In [35]:
companies = companies.astype({
    'name': 'string',
    'description': 'string',
    'state': 'string',
    'country': 'string',
    'city': 'string',
    'zip_code': 'string',
    'address': 'string',
    'url': 'string'
})

In [36]:
companies.to_csv('Updated_data/company_updated.csv', index=False)

In [37]:
companies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24473 entries, 0 to 24472
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   company_id    24473 non-null  int32
 1   name          24473 non-null  string
 2   description   24473 non-null  string
 3   company_size  24473 non-null  int32
 4   state         24473 non-null  string
 5   country       24473 non-null  string
 6   city          24473 non-null  string
 7   zip_code      24473 non-null  string
 8   address       24473 non-null  string
 9   url           24473 non-null  string
dtypes: int32(2), string(8)
memory usage: 1.7 MB

In [40]:
company_industries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24375 entries, 0 to 24374
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   company_id  24375 non-null  int64
 1   industry    24375 non-null  string
dtypes: int64(1), string(1)
memory usage: 381.0 KB

In [39]:
company_industries = company_industries.astype({
    'industry': 'string'})

In [41]:
company_industries.to_csv('Updated_data/company_industries.csv', index=False)

In [42]:
company_specialities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169387 entries, 0 to 169386
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   company_id  169387 non-null  int64
 1   speciality  169387 non-null  object
dtypes: int64(1), object(1)
memory usage: 2.6+ MB

In [43]:
company_specialities.head()

   company_id              speciality
0    22292832      window replacement
1    22292832  patio door replacement
2       20300      Commercial Banking
3       20300          Retail Banking
4       20300                Mortgage

In [44]:
company_specialities = company_specialities.astype({
    'speciality': 'string'})

In [75]:
company_specialities.to_csv('Updated_data/company_specialities.csv', index=False)

In [46]:
employee_counts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35787 entries, 0 to 35786
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_id      35787 non-null  int64
 1   employee_count  35787 non-null  int64
 2   follower_count  35787 non-null  int64
 3   time_recorded   35787 non-null  int64
dtypes: int64(4)
memory usage: 1.1 MB

In [47]:
employee_counts.head()

   company_id  employee_count  follower_count  time_recorded
0      391906             186           32508     1712346173
1    22292832             311            4471     1712346173
2       20300            1053            6554     1712346173
3     3570660             383           35241     1712346173
4      878353              52           26397     1712346173

In [52]:
employee_counts.to_csv('Updated_data/employee_counts.csv', index=False)

In [51]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40785 entries, 0 to 40784
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   salary_id          40785 non-null  int64
 1   job_id             40785 non-null  int64
 2   max_salary         40785 non-null  float64
 3   med_salary         40785 non-null  float64
 4   min_salary         40785 non-null  float64
 5   pay_period         40785 non-null  string
 6   currency           40785 non-null  string
 7   compensation_type  40785 non-null  string
dtypes: float64(3), int64(2), string(3)
memory usage: 2.5 MB

In [49]:
salaries.head(3)

,salary_id,job_id,max_salary,med_salary,min_salary,pay_period,currency,compensation_type
0,1,3884428798,0.0,20.0,0.0,HOURLY,USD,BASE_SALARY
1,2,3887470552,25.0,0.0,23.0,HOURLY,USD,BASE_SALARY
2,3,3884431523,120000.0,0.0,100000.0,YEARLY,USD,BASE_SALARY

In [50]:
salaries = salaries.astype({
    'pay_period': 'string',
    'currency': 'string',
    'compensation_type': 'string'
    
    })

In [53]:
salaries.to_csv('Updated_data/salaries.csv', index=False)

In [54]:
job_skills.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 213768 entries, 0 to 213767
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   job_id     213768 non-null  int64
 1   skill_abr  213768 non-null  object
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [55]:
job_skills = job_skills.astype({
    'skill_abr': 'string'})

In [56]:
job_skills.to_csv('Updated_data/job_skills.csv', index=False)

In [57]:
job_industries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 164808 entries, 0 to 164807
Data columns (total 2 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   job_id       164808 non-null  int64
 1   industry_id  164808 non-null  int64
dtypes: int64(2)
memory usage: 2.5 MB

In [58]:
job_industries.to_csv('Updated_data/job_industries.csv', index=False)

In [59]:
benefits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67943 entries, 0 to 67942
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   job_id    67943 non-null  int64
 1   inferred  67943 non-null  int64
 2   type      67943 non-null  object
dtypes: int64(2), object(1)
memory usage: 1.6+ MB

In [60]:
benefits.head(3)

       job_id  inferred               type
0  3887473071         0  Medical insurance
1  3887473071         0   Vision insurance
2  3887473071         0   Dental insurance

In [61]:
benefits = benefits.astype({
    'type': 'string'})

In [62]:
benefits.to_csv('Updated_data/benefits.csv', index=False)

In [63]:
industries = pd.read_csv('cleaned_data\Industries_cleaned.csv')
skills = pd.read_csv('cleaned_data\Skills_cleaned.csv')

In [64]:
industries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 422 entries, 0 to 421
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   industry_id    422 non-null    int64
 1   industry_name  422 non-null    object
dtypes: int64(1), object(1)
memory usage: 6.7+ KB

In [65]:
industries = industries.astype({
    'industry_name': 'string'})

In [66]:
industries.to_csv('Updated_data/industries.csv', index=False)

In [67]:
skills.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   skill_abr   35 non-null     object
 1   skill_name  35 non-null     object
dtypes: object(2)
memory usage: 692.0+ bytes

In [68]:
skills.head()

  skill_abr          skill_name
0       ART        Art/Creative
1      DSGN              Design
2      ADVR         Advertising
3      PRDM  Product Management
4      DIST        Distribution

In [69]:
skills = skills.astype({
    'skill_abr': 'string',
    'skill_name': 'string'
    })

In [70]:
skills.to_csv('Updated_data/skills.csv', index=False)

In [73]:
postings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35564 entries, 0 to 35563
Data columns (total 19 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   job_id                35564 non-null  int32
 1   company_name          35564 non-null  string
 2   title                 35564 non-null  string
 3   description           35564 non-null  string
 4   pay_period            35564 non-null  string
 5   location              35564 non-null  string
 6   company_id            35564 non-null  int32
 7   views                 35564 non-null  int32
 8   formatted_work_type   35564 non-null  string
 9   applies               35564 non-null  int32
 10  original_listed_time  35564 non-null  datetime64[ns]
 11  remote_allowed        35564 non-null  bool
 12  job_posting_url       35564 non-null  string
 13  expiry                35564 non-null  datetime64[ns]
 14  listed_time           35564 non-null  datetime64[ns]
 15  work_type             35564 non-null  string
 16  normalized_salary     35564 non-null  float64
 17  zip_code              35564 non-null  string
 18  fips                  35564 non-null  int32
dtypes: bool(1), datetime64[ns](3), float64(1), int32(5), string(9)
memory usage: 4.2 MB

In [72]:
postings = postings.drop(columns=[
    'max_salary',           # To be deleted
    'med_salary',          # To be deleted
    'min_salary',           # To be deleted
    'skills_desc',            # To be deleted
    'compensation_type',
    'currency'                  # To be deleted
])

In [74]:
postings.to_csv('Updated_data/postings.csv', index=False)